In [22]:
import pandas as pd
df=pd.DataFrame([[9,4,8,9],
                 [8,10,7,6],
                 [7,6,8,5]],
                columns=['Maths','English','Science','History'])
print(df)
df.agg(['sum','min','max','mean','median','std','count','size'])

   Maths  English  Science  History
0      9        4        8        9
1      8       10        7        6
2      7        6        8        5

        Maths    English    Science    History
sum      24.0  20.000000  23.000000  20.000000
min       7.0   4.000000   7.000000   5.000000
max       9.0  10.000000   8.000000   9.000000
mean      8.0   6.666667   7.666667   6.666667
median    8.0   6.000000   8.000000   6.000000
std       1.0   3.055050   0.577350   2.081666
count     3.0   3.000000   3.000000   3.000000
size      3.0   3.000000   3.000000   3.000000

# Grouping using Pandas

In [23]:
import pandas as pd
technologies = {
    'Courses':["Python","DBMS","JAVA","Python","DBMS","Spark"],
    'Fee':[20000,25000,26000,22000,24000,23000],
    'Duration':['30days','40days','35days','60days','30days','45days'],
    'Discount':[1000,2300,1200,2500,2000,1500]
}
df = pd.DataFrame(technologies)
print(df)

  Courses    Fee Duration  Discount
0  Python  20000   30days      1000
1    DBMS  25000   40days      2300
2    JAVA  26000   35days      1200
3  Python  22000   60days      2500
4    DBMS  24000   30days      2000
5   Spark  23000   45days      1500